Revit 2027 API
SpecTypeId.LuminousFlux Property
 Luminous Flux, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LuminousFlux { get; }
Public Shared ReadOnly Property LuminousFlux As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LuminousFlux {
	ForgeTypeId^ get ();
}
static member LuminousFlux : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace